Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 112, 112, 64)      1792
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 56, 56, 64)        0
_________________________________________________________________
dropout (Dropout)            (None, 56, 56, 64)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 56, 56, 128)       73856
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 28, 28, 128)       0
_________________________________________________________________
dropout_1 (Dropout)          (None, 28, 28, 128)       0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 26, 26, 256)       295168
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 13, 13, 256)       0
_________________________________________________________________
dropout_2 (Dropout)          (None, 13, 13, 256)       0
_________________________________________________________________
flatten (Flatten)            (None, 43264)             0
_________________________________________________________________
dense (Dense)                (None, 256)               11075840
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2570
=================================================================
Total params: 11,449,226
Trainable params: 11,449,226
Non-trainable params: 0
_________________________________________________________________